## reading the data from different sources

In [7]:
import pandas as pd 
from io import StringIO
data= '''
[
    {"name": "Alice Johnson", "email": "alice.johnson@example.com", "job_profile": "Data Analyst"},
    {"name": "Bob Smith", "email": "bob.smith@example.com", "job_profile": "Software Engineer"},
    {"name": "Charlie Davis", "email": "charlie.davis@example.com", "job_profile": "Project Manager"}
]
'''

In [8]:
data

'\n[\n    {"name": "Alice Johnson", "email": "alice.johnson@example.com", "job_profile": "Data Analyst"},\n    {"name": "Bob Smith", "email": "bob.smith@example.com", "job_profile": "Software Engineer"},\n    {"name": "Charlie Davis", "email": "charlie.davis@example.com", "job_profile": "Project Manager"}\n]\n'

In [10]:
df=pd.read_json(StringIO(data))

In [11]:
df

            name                      email        job_profile
0  Alice Johnson  alice.johnson@example.com       Data Analyst
1      Bob Smith      bob.smith@example.com  Software Engineer
2  Charlie Davis  charlie.davis@example.com    Project Manager

In [12]:
df.to_json('out.json')

In [13]:
df.to_json(orient='index')

'{"0":{"name":"Alice Johnson","email":"alice.johnson@example.com","job_profile":"Data Analyst"},"1":{"name":"Bob Smith","email":"bob.smith@example.com","job_profile":"Software Engineer"},"2":{"name":"Charlie Davis","email":"charlie.davis@example.com","job_profile":"Project Manager"}}'

In [14]:
df.to_json(orient='records')

'[{"name":"Alice Johnson","email":"alice.johnson@example.com","job_profile":"Data Analyst"},{"name":"Bob Smith","email":"bob.smith@example.com","job_profile":"Software Engineer"},{"name":"Charlie Davis","email":"charlie.davis@example.com","job_profile":"Project Manager"}]'

In [22]:
df=pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data',header=None)

In [23]:
df

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
173,3,13.71,5.65,2.45,20.5,95,1.68,0.61,0.52,1.06,7.70,0.64,1.74,740
174,3,13.40,3.91,2.48,23.0,102,1.80,0.75,0.43,1.41,7.30,0.70,1.56,750
175,3,13.27,4.28,2.26,20.0,120,1.59,0.69,0.43,1.35,10.20,0.59,1.56,835
176,3,13.17,2.59,2.37,20.0,120,1.65,0.68,0.53,1.46,9.30,0.60,1.62,840
177,3,14.13,4.10,2.74,24.5,96,2.05,0.76,0.56,1.35,9.20,0.61,1.60,560

In [24]:
df.to_csv('wine.csv')

In [28]:
url="https://www.fdic.gov/bank-failures/failed-bank-list"

df=pd.read_html(url)

In [52]:
%pip install openpyxl


## xml , beautifulsoup4, html5lib
## openpyxl for the excel data convertion

Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
   ---------------------------------------- 0.0/250.9 kB ? eta -:--:--
   ---------------------------------------- 0.0/250.9 kB ? eta -:--:--
   ---- ---------------------------------- 30.7/250.9 kB 435.7 kB/s eta 0:00:01
   --------- ----------------------------- 61.4/250.9 kB 544.7 kB/s eta 0:00:01
   --------------- ---------------------- 102.4/250.9 kB 737.3 kB/s eta 0:00:01
   -------------------------- ----------- 174.1/250.9 kB 952.6 kB/s eta 0:00:01
   -------------------------- ----------- 174.1/250.9 kB 952.6 kB/s eta 0:00:01
   -------------------------------------  245.8/250.9 kB 835.2 kB/s eta 0:00:01
   -------------------------------------- 250.9/250.9 kB 810.3 kB/s eta 0:00:00
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5
Note: you may need to restart the kernel to use updated packages.

In [29]:
df

[                               Bank Name               City         State  \
 0                   Pulaski Savings Bank            Chicago      Illinois
 1     The First National Bank of Lindsay            Lindsay      Oklahoma
 2  Republic First Bank dba Republic Bank       Philadelphia  Pennsylvania
 3                          Citizens Bank           Sac City          Iowa
 4               Heartland Tri-State Bank            Elkhart        Kansas
 5                    First Republic Bank      San Francisco    California
 6                         Signature Bank           New York      New York
 7                    Silicon Valley Bank        Santa Clara    California
 8                      Almena State Bank             Almena        Kansas
 9             First City Bank of Florida  Fort Walton Beach       Florida

     Cert                 Aquiring Institution      Closing Date  \
 0  28611                      Millennium Bank  January 17, 2025
 1   4134   First Bank & Trust Co., Duncan, OK  October 18, 2024
 2  27332    Fulton Bank, National Association    April 26, 2024
 3   8758            Iowa Trust & Savings Bank  November 3, 2023
 4  25851               Dream First Bank, N.A.     July 28, 2023
 5  59017            JPMorgan Chase Bank, N.A.       May 1, 2023
 6  57053                  Flagstar Bank, N.A.    March 12, 2023
 7  24735  First Citizens Bank & Trust Company    March 10, 2023
 8  15426                          Equity Bank  October 23, 2020
 9  16748            United Fidelity Bank, fsb  October 16, 2020

    Fund  Sort ascending
 0                 10548
 1                 10547
 2                 10546
 3                 10545
 4                 10544
 5                 10543
 6                 10540
 7                 10539
 8                 10538
 9                 10537  ]

In [31]:
dataset=pd.DataFrame(df[0])

In [32]:
dataset

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund Sort ascending
0,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
1,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
2,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
3,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
4,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
5,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
6,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
7,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
8,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
9,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537

In [49]:
url="https://keshavrajpore.netlify.app/sql"

df=pd.read_html(url,match="SQL Topic Names",header=0)

In [46]:
pd.DataFrame(sqldata[0])

,Done,Sr. No,SQL Topic Names,Watch on YouTube,Learn More
0,NaN,1,Introduction to SQL,NaN,NaN
1,NaN,2,How To Download Workbench and Creating a Database,NaN,NaN
2,NaN,3,"Data Type, Operator And Constraints (Theory)",NaN,NaN
3,NaN,4,Creating a Table,NaN,NaN
4,NaN,5,Inserting Data,NaN,NaN
5,NaN,6,Selecting Data,NaN,NaN
6,NaN,7,Updating Data,NaN,NaN
7,NaN,8,Deleting Data,NaN,NaN
8,NaN,9,Filtering Data,NaN,NaN
9,NaN,10,Sorting Data,NaN,NaN
10,NaN,11,Using Joins,NaN,NaN
11,NaN,12,Aggregate Functions,NaN,NaN
12,NaN,13,Subqueries,NaN,NaN
13,NaN,14,Creating Indexes,NaN,NaN
14,NaN,15,Revision IMP Topics,NaN,NaN
15,NaN,16,Managing Transactions,NaN,NaN
16,NaN,17,Views,NaN,NaN

In [53]:
dataset.to_excel('dataexe.xlsx')

In [54]:
df_excel=pd.read_excel('dataexe.xlsx')

In [55]:
df_excel.to_pickle('df_excel')

In [56]:
pd.read_pickle('df_excel')

,Unnamed: 0,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund Sort ascending
0,0,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
1,1,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
2,2,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
3,3,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
4,4,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
5,5,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
6,6,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
7,7,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
8,8,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
9,9,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537

In [13]:
import pandas as pd
from faker import Faker
fake=Faker()

print(fake.name())
print(fake.credit_card_number())
print(fake.job())
print(fake.email())
print(fake.date_of_birth())
print(fake.country())
print(fake.address())
print(fake.random_int(18,60))

Eduardo Herrera
349284588928952
Emergency planning/management officer
vlee@example.net
2000-12-07
Falkland Islands (Malvinas)
8751 Jackson Causeway Apt. 678
New Kennethborough, GU 60653
26

In [14]:
data=[]
for _ in range(2000):
    data.append({
        "name": fake.name(),
        "email": fake.email(),
        "address":fake.address(),
        "country": fake.country(),
        "job title": fake.job(),
        "date of birth": fake.date_of_birth()

    })

In [16]:
dataset=pd.DataFrame(data)

In [18]:
dataset

,name,email,address,country,job title,date of birth
0,Scott Brown,tnielsen@example.org,"02494 Carroll Cove Suite 996\nBrooksside, OK 7...",Bahrain,Commercial/residential surveyor,2014-02-27
1,Jeremy Turner,willie02@example.org,9303 Bell Turnpike Suite 529\nEast Melaniefort...,New Caledonia,Airline pilot,1990-05-03
2,Rickey Clark,kelly02@example.org,"PSC 1444, Box 3698\nAPO AA 79996",Lesotho,Merchant navy officer,2023-05-16
3,Marcus Figueroa,kmueller@example.org,USCGC Taylor\nFPO AP 41779,Turkey,Veterinary surgeon,1988-06-30
4,Michael Orozco,wpatel@example.com,USNS Wilson\nFPO AA 76320,Ireland,Veterinary surgeon,2006-06-16
...,...,...,...,...,...,...
1995,Miss Amanda Herrera DVM,johnnyrodriguez@example.com,USNS Sanchez\nFPO AA 94691,Saint Pierre and Miquelon,Illustrator,2014-05-05
1996,Lisa West,jeffery31@example.org,"2585 Rogers Grove\nRaymondview, PR 16265",Greece,Dealer,1963-10-02
1997,Ashley Brown,howardcorey@example.net,"56645 Mack Mills Suite 562\nWest Jason, TN 49843",Palestinian Territory,Sport and exercise psychologist,1981-04-25
1998,Christina Olson,randy37@example.org,"570 Patel Tunnel Apt. 060\nMckinneymouth, TN 9...",Saudi Arabia,Sales executive,1963-05-02
1999,Laurie Anthony,larry54@example.net,"078 Denise Route\nWarnerchester, WI 74654",Lebanon,Civil Service fast streamer,1947-11-17